# Рассмотрим последовательность целых чисел длины N. По ней с шагом 1 двигается “окно” длины K, то есть сначала в “окне” видно первые K чисел, на следующем шаге в “окне” уже будут находиться K чисел, начиная со второго, и так далее до конца последовательности. 
# Требуется для каждого положения “окна” определить минимум в нём.

# Входные данные
# В первой строке входных данных содержатся два числа N и K (1 ≤  N ≤  150000, 1 ≤ K ≤ 10000, K ≤  N) – длины последовательности и “окна”, соответственно. На следующей строке находятся N чисел – сама последовательность.

# Выходные данные
# Выходые данные должны содержать N − K + 1 строк – минимумы для каждого положения “окна”.

n, k = map(int, input().split())
arr = list(map(int, input().split()))

queue = []
for i in range(n):
    while len(queue) > 0 and queue[0] <= i - k:
        queue.pop(0)
    while len(queue) > 0 and arr[queue[-1]] > arr[i]:
        queue.pop()
    queue.append(i)
    if i >= k - 1:
        print(arr[queue[0]])
